Repository: mozilla-l10n/mt-training-data
Catalog: ha/ha_pontoon.tmx
Source language: en_us
Languages: ha

source: This email is automatically sent by a robot. Our robot can’t respond to your question, but our forum contributors can! If you want to respond to them, please <a href="%(url)s">click here</a>.
ha: Bobot ne ya aika da wannan imel kai tsaye. Robot ɗinmu ba zai iya amsa tambayarka ba, amma masu bayar da gudun mawa na dandalinmu za su iya! Idan kana so ka ba su amsa, <a href="%(url)s">danna nan</a>.

source: This email looks great!
ha: Da alama imel ɗin yana da kyau!

source: This feature is temporarily disabled while we perform website maintenance. Please use your browser's Back button and try again a little later.
ha: An dakatar da wannan kamanni na wani lokaci yayin da muke gyara a dandalinmu na yanar gizo. Yi amfani da madannin mai gewayarka domin komawa baya kuma ka sake jarrabawa nan da wani lokaci.

source: This field was populated automatically.
ha: Wannan filin zai cika kai tsaye.

source: This forum is a discussion about improving the localization of the "%(title)s" article. If you want to improve the article content, go to the <a href="%(url)s">English article discussion</a>.
ha: Wannan tattaunawa ne a kan inganta fassara ta "%(title)s" maƙala. Idan ka na so ka inganta abin ciki na maƙalar, jeka zuwa <a href="%(url)s">tattauna maƙaloli da Turanci</a>.

source: This forum is a discussion about improving the "%(title)s" article.
ha: Wannan dandalin tattaunawa ne dangane da inganta "%(title)s" maƙala.

source: This forum is a discussion about improving the "%(title)s" article. If you'd like to participate, please <a href="%(register_url)s">register</a>.
ha: Wannan dandalin tattaunawa ne dangane da inganta "%(title)s" maƙala. Idan ka na so ka shiga, <a href="%(register_url)s">rijista</a>.

source: This happened
ha: Wannan ya faru

source: This happens
ha: Wannan yana faruwa

source: This image is not included in any articles.
ha: Wannan hoton ba'a haɗashi a kowane maƙaloli ba.

source: This information gives details about the internal workings of your browser that will help in answering your question.
ha: Wannan bayanin ya bayar da cikakken bayani dangane da aiki daga ciki na mai gewayawarka wanda zai taimaka wajen amsa tambayarka.

source: This is a staging site, the content gets overwritten on the 1st of every month.<br>The production site is <a href="http://support.mozilla.org">here</a>.
ha: Wannan dandali ne mai mataki, ana sake rubuta abin cikinsa a farkon ko wane wata.<br>dandalin samarwar shi ne <a href="http://support.mozilla.org">here</a>.

source: This is the number of all Knowledge Base articles that are ready to be localized.
ha: Wannan ita ce lambar dukkan Maƙaloli Masu Tushen Ilimi waɗan da suke shirye a fassarasu.

source: This is your current email.
ha: Wannan shine imel ɗinka na yanzu.

source: This page doesn't have a mobile optimized version. Tap here to go back.
ha: Wannan shafin ba shi da yayin inganta wayar hannu. Danna domin komawa baya.

source: This question already has a solution.
ha: Wannan tambayar tuni tana da mafita.

source: This question has not been asked before.
ha: Ba'a yi irin wannan tambaya ba a baya.

source: This revision is not ready for localization.
ha: Wannan nazarin ya shirya domin fassarawa.

source: This revision is ready for localization.
ha: Wannan nazarin ya shirya domin fassarawa.

source: This revision was already reviewed by {user} on {date}.
ha: Wannan nazari tuni an sake nazarinsa daga {user} ranar {date}.

source: This started when...
ha: Wannan ya fara lokacin da...

source: This thread has been locked. It is no longer possible to post new replies.
ha: An kulle wannan tattaunawa. Ba zai yiwa ka aika sabuwar amsa ba.

source: This thread was archived.
ha: Wannan tattunawa ta zama daɗaɗɗiya.

source: This thread was closed.
ha: An rufe wannan tattaunawa.

source: This thread was closed and archived.
ha: Wannan tattaunawa an rufeta kuma ta zama daɗaɗɗiya.

source: This translation was already reviewed by {user} on {date}.
ha: An riga an yi nazarin wannan fassara daga {user} ranar {date}.

source: This tweet doesn't need a response
ha: Wannan tweet ɗin ba ya bukatar amsa

source: This user has been deactivated.
ha: An dakatar da wannan mai amfanin.

source: This username is already taken!
ha: An riga a ɗauni wannan sunan amfanin!

source: This username is available.
ha: Babu wannan sunan mai amfanin.

source: This will help other Firefox users find good answers to their questions!
ha: Wannan zai taimakawa sauran masu amfani da Firefox su samo amsoshi masu kyau ga tambayoyinsu!

source: This will notify localizers and translations will be marked as "needing updates" on dashboards. Most changes&mdash;updating an image, fixing {for} markup, adding or removing non-critical sections&mdash;should use this.
ha: Wannan zai sanar da masu fassara kuma za'a yiwa fassara alama a matsayin "mai bukatar sabuntawa" a jikin alluna. Yawaicin canje-canje&mdash;sabunta hoto, gyara {for} saka alama, daɗawa ko cirewa na ɓangarori marasa mahimmanci&mdash;zai yi amfani da wannan.

source: This will notify localizers and translations will be marked "out of date" on dashboards. Translations will show a warning to users that they are out of date and that the English version is the most accurate. Use this when the old instructions are completely unusable.
ha: Wannan zai sanar wa masu fassara kuma za'a yiwa fassarar alama "daɗaɗɗiya" a jikin alluna. Fassara za ta nuna gargaɗi ga masu amfani cewa suna cikin daɗaɗɗiya kuma na Turancin shi ne ya fi dai dai. Yi amfani da wannan idan tsohon gargaɗin ba shi da amfani gaba ɗaya.

source: Thread contains
ha: Tattaunawa ta haɗa da

source: Thread type
ha: Yanayin tattaunawa

source: Thunderbird controls and buttons
ha: Tafiyar da Thunderbird da madannai

source: Thunderbird crashes
ha: Thunderbird ya yi karo

source: Thunderbird is slow or stops working
ha: Thunderbird baya sauri ko kuma ya daina aiki

source: Thunderbird options, preferences and settings
ha: Zaɓin Thunderbird, abubuwan da aka fi so da saituna

source: Thunderbird versions and languages
ha: Yayin Thunderbird da yaruka

source: Thunderbird won't save settings or remember information
ha: Thunderbird ba zai iya ajiye saituna ba ko tuna bayani

source: Timezone
ha: Lokacin shiyya

source: Tips and tricks
ha: Shawarwari da dabaru

source: Title
ha: Take

source: Title:
ha: Take:

source: {title} has a revision ready for localization
ha: {title} yana da nazari da ya shiya domin fassara

source: Title in {locale}:
ha: Take a {locale}:

source: {title} is ready for review ({creator})
ha: {title} ya shirya domin sake nazari ({creator})

source: {title} ({locale}) has a new approved revision ({reviewer})
ha: {title} ({locale}) yana da abon nazari da aka amince da shi ({reviewer})

source: {title} | Media Gallery
ha: {title} | Ma'ajiyar Hotuna

source: Title of article
ha: Taken maƙala

source: {title} was edited by {creator}
ha: {title} gyara daga {creator}

source: To:
ha: Zuwa:

source: To activate your account you must first confirm your email address. Enter your email and submit the form below, and we will resend the confirmation email.
ha: Domin farfaɗo da asusunka dole da farko ka tabbatar da adireshinka na imel. Shigar da imel ɗinka kuma ka miƙa fom da ya ke ƙasa, kuma zamu sake aikawa da imel na tabbatarwa.

source: To confirm your subscription, please click the link below or copy and paste the whole thing into your browser's location bar:
ha: Domin tabbatar da sautunka, danna haɗin ƙasa ko ka juya kuma ka liƙa komai saɗara ta wajen mai gewayawa:

source: Today at %s
ha: Yau da %s

source: To delete the document, please notify an admin.
ha: Domin goge daftarin, sanar da masu gudanarwa.

source: To field is required.
ha: Ana bukatar To field.

source: Toggle Diff
ha: Tawata Bambanci

source: Toggle syntax highlighting
ha: Yawata tsarin kalmomin da aka yiwa alma

source: To help you find out where to help check this site:
ha: Domin taimaka maka binciken wurin da za ka bayar da taimako duba wannan dandalin:

source: To localize the document, click the following link, or paste it into your browser's location bar:
ha: Domin fassara bayanin, danna wannan haɗin, ko ka liƙa shi a wurin sandar mai gewayawa:

source: Too long
ha: Tsawo da yawa

source: Tools for creating and teaching the web
ha: Kayayyaki domin ƙirƙira da kuma kayarwa a yanar gizo

source: Top 100 Articles
ha: Fitattun Maƙaloli 100

source: Top 10 Contributor
ha: Fitattun masu bayar da gudun mawa 10

source: Top 20 Articles
ha: Fitattun maƙaloli 20

source: Top 25 Contributor
ha: Fitattun masu bayar da gudun mawa 25

source: Top 50 Articles
ha: Fitattun Maƙaloli 50

source: Top contributors
ha: Fitattun masu bayar da gudun mawa

source: Top Contributors - Army of Awesome
ha: Fitattun Masu Bayar da Gudun mawa - Rundunar Burgewa

source: Top Contributors - Knowledge Base
ha: Fitattun Masu Bayar da Gudun mawa - Tushen Ilimi

source: Top Contributors - Localization
ha: Fitattun Masu Bayar da Gudun mawa - Fassara

source: Top Contributors - Support Forum
ha: Fitattun Masu Bayar da Gudun mawa - Dandalin Tallafi

source: Topic
ha: Batu

source: Topics
ha: Batutuwa

source: Topics:
ha: Batutuwa:

source: To post your question, please create a support account
ha: Domin aikawa da tambayarka, ƙirƙiri asusu na tallafi

source: To review this revision, click the following link, or paste it into your browser's location bar:
ha: Domin sake nazari, danna wannan haɗin, ko ka liƙa a wurin sandar mai gewayawa:

source: Total:
ha: Jimla:

source: Total questions: <strong>{num}</strong>
ha: Jimlar tambayoyi: <strong>{num}</strong>

source: Total Votes
ha: Jimlar Ƙuri'u

source: To view the history of this document, click the following link, or paste it into your browser's location bar:
ha: Domin ganin tarihin wannan daftari, danna haɗi mai zuwa, ko ka liƙa a wurin sandar mai gewayawaka:

source: To view the updated document, click the following link, or paste it into your browser's location bar:
ha: Domin ganin bayanin da aka sabunta, danna wannan haɗin mai zuwa, ko ka liƙa a wurin sandar mai gewayawa:

source: To view this document's history, click the following link, or paste it into your browser's location bar:
ha: Domin ganin tarihin wannan bayani, danna wannan haɗin, ko ka liƙa wurin sandar mai gewayawa:

source: To view this post on the site, click the following link, or paste it into your browser's location bar:
ha: Domin ganin wannan aike a dandali, danna wannan haɗin, ko ka liƙashi a saɗara ta wurin mai gewayawa:

source: Transaction ID:
ha: Lambar Hulɗa:

source: Translate Article
ha: Fassara Maƙala

source: Translate Article | {document}
ha: Fassara Maƙala | {document}

source: Translate Content
ha: Fassara Abin ciki

source: Translate Description
ha: Kwatanta Fassara

source: Translate help articles!
ha: Fassara maƙaloli na taimako!

source: Translate Help Articles
ha: Fassara Maƙaloli na Taimako

source: Translate help articles to your language
ha: Fassara maƙalolin taimako zuwa yarenka

source: Translate help to your languages
ha: Fassara taimako zuwa yarukanku

source: Translating 1 article can help 1,000's of users in your language
ha: Fassara maƙala 1 na iya taimakawa 1,000's na masu amfani a yarenka

source: Translating article to {locale}
ha: Fassara maƙala zuwa {locale}

source: Translating {title}
ha: Fassarawa {title}

source: Translation Comment: {comment}
ha: Sharhin Fassara: {comment}

source: Translation keywords:
ha: Mahimmiyar kalma ta Fassara:

source: Translation Needed
ha: Ana bukatar fassara

source: Translation rendered html:
ha: An mayar da fassara html:

source: Translation search results summary:
ha: Taƙaitaccen sakamako na binciken fassara:

source: Translation source:
ha: Tushen fassara:

source: Trash
ha: Shara

source: Troubleshoot error message on Firefox for iOS
ha: Yi maganin matsalar saƙwanni a Firefox domin iOS

source: Troubleshoot error messages on Thunderbird.
ha: Magance saƙwannin kuskure a Thunderbird.

source: Troubleshooting
ha: Warware matsala

source: Troubleshooting Information
ha: Bayanin warware matsala

source: Try another topic
ha: Jarraba wani batun

source: Try one of these articles:
ha: Jarraba ɗaya daga cikin waɗannan maƙaloli:

source: Turn off emails for discussion in my locale.
ha: Kashe imel domin tattaunawa a wuri na.

source: Tweak it and make it your own. Personalized messages go a long way in helping others.
ha: Murɗashi ya zama na ka. Mayar da saƙwanni na ƙashin kai bi hanyar taimakawa wasu.

source: Tweet has already been replied to
ha: Tuni an bayar da amsa ga Tweet

source: Tweets that are replies or have replies must not be hidden.
ha: Tweets waɗanda suke da amsoshi ko su na amsoshi dole ba za'a ɓoyesu ba.

source: {t} with id={id} no longer exists.
ha: {t} tare da id={id} babu shi.

source: Twitter account
ha: Asusun Twitter

source: Twitter Contributor - Respond to tweets about Firefox:
ha: Mai bayar da gudun mawa a Twitter - Amsoshin tweets dangane da Firefox:

source: Twitter Handles:
ha: Masarrafar Twitter:

source: Twitter Username
ha: Sunan mai amfani na Twitter

source: Type
ha: Iri

source: Type of article
ha: Yanayin maƙala

source: Unable to change email for user {username}
ha: Ya gaza canja imel domin mai amfani {username}

source: Unable to delete only revision of the document
ha: Ya gaza goge nazari kawai na daftarin

source: Unanswered
ha: Wanda ba'a amsa ba

source: Unarchive this question
ha: Daina ajiyar wannan tambaya

source: Unban
ha: Janye kora

source: Unblock Firefox from connecting to the Internet
ha: Dakatar da tsare Firefox daga haɗawa da intanet

source: Unblock Thunderbird from connecting to the Internet
ha: Buɗe Thunderbird daga haɗi zuwa intanet

source: Undo
ha: Fasa

source: Unhelpful
ha: Marar taimakawa

source: Unhelpful Documents
ha: Daftari marar taimakawa

source: Unlock this question
ha: Buɗe wannan tambaya

source: Unlock this thread
ha: Buɗe wannan tattaunawa

source: Unmark as spam
ha: Cire alama a matsayin wasiƙa gayyar-soɗi

source: Unrecognized media type.
ha: Yanayin kiɗa da ba'a shaida ba.

source: Unrecognized request or nothing to cancel.
ha: Nema da ba'a shaida ba ko babu abin sokewa.

source: Unreviewed
ha: Wanda ba'a sake nazari ba

source: Unreviewed Changes
ha: Canje-canje da ba'a yi nazari ba

source: Unsticky this thread
ha: Cire liƙa wannan tattaunawa

source: Unsubscribe
ha: Daina sautu

source: Unsubscribe from edit notifications
ha: Daina sautu daga sanarwar gyara

source: Unsubscribe from these emails
ha: Daina sautu daga waɗan nan imels

source: Unsubscribe from these emails:
ha: Daina sautu daga waɗan nan imels:

source: Update
ha: Sabuntawa

source: Update answer
ha: Sabunta amsa

source: Updated
ha: An sabunta

source: Updated:
ha: An sabunta:

source: Updated date. Format: mm/dd/yy
ha: Kwanan watan sabuntawa. Nau'i: mm/dd/yy

source: Update Needed
ha: Akwai bukatar Sabuntawa

source: Update post
ha: Sabunta aike

source: Update Status:
ha: Sabunta Matsayi:

source: Update thread
ha: Sabunta tattaunawa

source: Upload
ha: Loda

source: Upload a New Media File
ha: Loda Sabon Fayil na Kaɗe-kaɗe

source: Upload cancelled. Please select an image file.
ha: An soke lodawa. Zaɓi fayil na hotuna.

source: Uploaded {date}
ha: Wanda aka loda {date}

source: Uploaded images:
ha: Loda hotuna:

source: Upload file
ha: Loda fayil

source: Uploading "%s"...
ha: Yana lodawa "%s"...

source: Upload Media
ha: Loda Kiɗa

source: URL of affected site
ha: URL na dandalin da abin ya shafa

source: Use advanced search
ha: Yi amfani da nema mai zurfi

source: Use basic search
ha: Yi amfani da nema na asali

source: Use bookmarks
ha: Yi amfani da zaunanniyar alam

source: Used by more than 400 million people, Mozilla support is fully powered by volunteers, and it’s more important than ever. This is where you come in.
ha: Masu amfani fiye da mutane miliyan 400, tallafin Mozilla na samun cikakkiyar ƙarfafawa daga 'yan sa-kai, kuma ko yaushe tana da mahimmanci. Nan na inda za ka shigo.

source: user
ha: mai amfani

source: User
ha: Mai amfani

source: User Agent: {ua}
ha: Wakilin Mai amfani: {ua}

source: User Agent: {user_agent}
ha: Agent na mai amfani: {user_agent}

source: User Control
ha: Tafiyarwa ta Mai amfani

source: {user} | Documents
ha: Daftarorin | {user}

source: User Interface
ha: Ƙawar mai amfani

source: {user} is currently working on this problem.
ha: {user} yanzu yana aiki a kan wannan matsalar.

source: username
ha: sunan mai amfani

source: Username
ha: Sunan mai amfani

source: Username:
ha: Sunan mai amfani:

source: username1, username2,...
ha: mai amfani na 1, mai amfani na 2,...

source: Username, Display Name or Twitter Handle
ha: Sunan mai amfani, Nuna Suna ko Mai sarrafa Twitter

source: {username} is not a valid username.
ha: {username} ba sunan da ya dace ba ne.

source: Username is required.
ha: Ana bukatar sunan mai amfani.

source: Username is too long (%(show_value)s characters). It must be %(limit_value)s characters or less.
ha: Sunan mai amfani ya yi tsawo sosai (%(show_value)s characters). Dole ya zama haruffa %(limit_value)s ko ƙasa.

source: Username is too short (%(show_value)s characters). It must be at least %(limit_value)s characters.
ha: Sunan mai amfani ya yi gajarta sosai (%(show_value)s characters). Dole ya zama a ƙalla haruffa %(limit_value)s.

source: Username may contain only English letters, numbers and ./-/_ characters.
ha: Sunan mai amfani na iya ƙunsar baƙaƙen Turanci kawai da haruffan ./-/_.

source: Username not provided.
ha: Ba'a bayar da sunan mai amfani ba.

source: {user} - {num} contributions in last 90 days
ha: {user} - {num} gudun mawa kwanaki 90 da suka gabata

source: {user} | Profile
ha: Tarihin | {user}

source: {user} removed from successfully!
ha: An sami nasarar cire mai amfani {user}!

source: {user} removed from the contributors successfully!
ha: An sami nasarar cire {user} daga masu bayar da gudun mawa!

source: {user} removed from the group leaders successfully!
ha: {user} an cireshi daga jagororin ƙungiya cikin nasara!

source: {user} removed from the group successfully!
ha: {user} an cireshi daga ƙungiya cikin nasara!

source: Users:
ha: Masu Amfani:

source: {users} added successfully!
ha: An sami nasarar ƙara {users}!

source: {users} added to the contributors successfully!
ha: An sami nasarar daɗa {users} ga masu bayar da gudun mawa!

source: {users} added to the group leaders successfully!
ha: {users} an saka shi a jagororin ƙungiya cikin nasara!

source: {users} added to the group successfully!
ha: An sami nasarar daɗa {users} zuwa ƙungiya!

source: {user}'s Groups
ha: Ƙungiyar {user}'s

source: Using a feature on webmaker.org
ha: Yin amfani da siffofi a kan webmaker.org

source: Using Popcorn Maker
ha: Amfani da Popcorn Maker

source: Using Thimble
ha: Yi amfani da shafi

source: Using X-Ray Goggles
ha: Yi amfani da Tabarau na X-Ray

source: Value
ha: Kima

source: Verify your email address:
ha: Tantance adireshinka na imel:

source: Video, audio and interactive settings
ha: Bidiyo, abin saurare da kuma saituna na hulɗa

source: Videos
ha: Bidiyoyi

source: Videos, sound, pictures and animations don't work
ha: Bidiyoyi, sauti, hotuna da hotuna masu motsi ba sa aiki

source: View a list of all Firefox OS articles
ha: Kalli duk jeri na maƙalolin Firefox OS

source: View all deactivated users
ha: Duba duk masu amfanin da ba'a farfaɗo da su ba

source: View all Firefox OS articles
ha: Kalli duk maƙaloli na Firefox OS

source: View Diff
ha: Kalli Bambanci

source: View other questions that need attention.
ha: Kalli sauran tambayoyi waɗanda ke bukatar kulawa.

source: View Profile
ha: Tarihi

source: Views
ha: Ra'ayoyi

source: View the history of this document
ha: Kalli tarihin wannan daftari

source: View the solution
ha: Kalli mafitar

source: View the updated document
ha: Kalli daftarin da aka sabunta

source: View this document's history
ha: Kalli tarihin wannan daftari

source: View this message on the web
ha: Kalli wannan saƙon a yanar gizo

source: View this message on the web:
ha: Kalli wannan saƙon a yanar gizo:

source: View this post on the site.
ha: Kalli wannan aiken a wannan dandalin.

source: Visitors
ha: Masu Ziyara

source: Visits
ha: Ziyarce-ziyarce

source: Visits in last 30 days
ha: Ziyarce-ziyarce a kwanaki 30 da suka gabata

source: Volunteer for Mozilla Support
ha: Mai aikin sa-kai domin Tallafawa Mozilla

source: Votes
ha: Ƙuri'u

source: votes this week
ha: ƙuri'u na wannan mako

source: Waiting for review
ha: Jiran yin nazari

source: Want to know when a solution is found?
ha: Kana so ka san lokacin da aka sami mafita?

source: WARNING! Are you sure you want to deactivate this user? This cannot be undone!
ha: GARGAƊI! Ka tabbatar kana so ka dakatar da wannan mai amfani? Ba za'a iya wannan ba!

source: Warning: There are newer unreviewed revisions of this article.
ha: Gargaɗi: Akwai sababbin nazari da ba'a duba ba na wannan maƙala.

source: Warning: This page is also being edited by %(user)s!
ha: Gargaɗi: Wannan shafin yana samun gyara daga %(user)s!

source: was marked as solved by its asker, {asker}.
ha: an yi mata alama a matsayin an warware daga mai tambayar, {asker}.

source: Was this article helpful?
ha: Wannan maƙalar ta taimaka?

source: Was this helpful to you?
ha: Wannan ya taimaka maka?

source: Watch
ha: Kallo

source: Watch forum threads I comment in
ha: Kalli tattaunawar dandali | yi sharhi a

source: Watch forum threads I start
ha: Kalli tattaunawar dandali | fara

source: Watch KB discussion threads I comment in
ha: Kalli tattaunawar KB | yi sharhi a

source: Watch KB discussion threads I start
ha: Kalli tattaunawar KB | fara

source: Watch our videos and check our documentation
ha: Kalli bidiyoyinmu kuma ka duba bayananmu

source: Watch Question threads I comment in
ha: Kalli tattaunawar Tambaya | yi sharhi a

source: Watch this forum
ha: Kalli wannan dandali

source: Watch this locale
ha: Kalli wannan wurin

source: Watch this thread
ha: Kalli wannan tattaunawa

source: We are always very happy to hear from new people who like helping on the forums so if you haven’t met our community yet <a href="%(intro_url)s"> please take a minute to introduce yourself </a>. If you want to stay low-profile, that’s also ok :). You can also find us all hanging out on IRC, on the <a href="%(irc_url)s"> #sumo channel </a>.
ha: Ko yaushe muna farin ciki mu ji daga sababbin mutane waɗanda ke son taimakawa a dandalinmu sabo da haka idan ba ka haɗu da ƙungiyarmu ba tukuna <a href="%(intro_url)s"> ware wani lokaci ka gabatar da kanka </a>. Idan ka na so ka zama kai kaɗai, to shi ke nan:). Kuma za ka iya samunmu muna jira a IRC, a <a href="%(irc_url)s"> #sumo channel </a>.

source: We are always very happy to hear from new people who like helping on the forums so if you haven’t met our community yet please take a minute to introduce yourself. If you want to stay low-profile, that’s also ok :). You can also find us all hanging out on IRC, on the #sumo channel on irc.mozilla.org.
ha: Ko yaushe muna farin ciki mu ji daga sababbin mutane waɗanda ke son taimakawa a dandalinmu sabo da haka idan ba ka haɗu da ƙungiyarmu ba tukuna ware wani lokaci ka gabatar da kanka. Idan ka na so ka ci gaba da ɓoye kanka, to shi ke nan:). Kuma za ka iya samunmu muna jira a IRC, a #sumo channel on irc.mozilla.org.

source: We are having trouble reaching your email address. Please try a different address or contact an administrator.
ha: Muna shan wahala wajen neman adireshinka na imel. Jarraba wani adireshin daban ko ka tuntuɓi mai gudanarwa.

source: Web browser for Android smartphones and tablets
ha: Mai gewayawa na yanar gizo domin manyan wayoyi na Android da ƙananan kwamfutoci

source: Web browser for Windows, Mac and Linux
ha: Mai gewayawa domin Windows, Mac da Linux

source: Website
ha: Tashar yanar gizo

source: Websites
ha: Dandalin yanar gizo
